# Неверные данные ---------------------------------------------------------

data <- readxl::read_excel("01-practice/02-bad-data.xlsx")

print(data)
mean(data$x1) # 2.243333
mean(data$x2) # NA
mean(data$x3) # NA


# Число (numeric) ---------------------------------------------------------

1      # 1
1.23   # 1.23
1 / 3  # 0.3333333
-1.23  # -1.23


# Логическое (logical) ----------------------------------------------------

# 1 и 0 не являются логическими значениями - это числа

TRUE
FALSE


# Строка (character) ------------------------------------------------------

"Это текст в двойных кавычках"
'Или в одинарных'
"Частичный ответ после МРТ на 01.02.2003 по месту жительства"
c("ЧО", "ПО")


# Категория (factor) ------------------------------------------------------

factor(
  c("ЧО", "ПО", "Частичный ответ"),
  levels = c("СЗ", "ЧО", "ПО")
)

# ЧО   ПО   <NA>
# Levels: СЗ ЧО ПО


# Not Available (неизвестные значения) ------------------------------------

NA
NA + 1           # NA
(NA + 1 + 1) / 3 # NA


# Дата --------------------------------------------------------------------

as.Date("2025-04-18")      # "2025-04-18"
as.Date("2025-04-18") + 30 # "2025-05-18


# Нормальный Excel --------------------------------------------------------

data <- readxl::read_excel("01-practice/02-good-data.xlsx")

print(data)
mean(data$x1) # 2.243333
mean(data$x2) # 2.243333
mean(data$x3) # 1.936667

data$z <- factor(data$z, c("СЗ", "ЧО", "ПО"))
data$z


# summary -----------------------------------------------------------------

summary(data)
str(data)
